tap "homebrew/bundle"
tap "homebrew/services"
tap "zegervdv/zathura"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive environments for writing and running code
brew "jupyterlab"
# Quickly generate a temporary email address
brew "mailsy"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# File browser
brew "ranger"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Translate common Internet acronyms
brew "wtf"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Interface library
brew "zegervdv/zathura/girara", args: ["HEAD"]
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["HEAD"]
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Application uninstaller
cask "appcleaner"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
vscode "atlassian.atlascode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-monokai-night"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "glenn2223.live-sass"
vscode "j69.ejs-beautify"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
